      //---------------------------------------------------------
      //  Files
      //---------------------------------------------------------

       dcl-f CUSTSUMS  usage(*output);
      //---------------------------------------------------------
      //  Main Procedure
      //---------------------------------------------------------

       write CUSTSUM;

       *inlr = *on;


