      //---------------------------------------------------------
      //  Files
      //---------------------------------------------------------

       dcl-f CUSTSUMS  usage(*output);
      //---------------------------------------------------------
      //  Main Procedure
      //---------------------------------------------------------
       CUSTID = 'A001';
       SUM = 1000;

       write CUSTSUM;

       *inlr = *on;


